import sqlite3

# データベースへの接続を確立
conn = sqlite3.connect('ow2_type.db')

# カーソルを取得
cursor = conn.cursor()

# テーブルを作成
cursor.execute('''CREATE TABLE types (
    id INTEGER PRIMARY KEY,
    dive INTEGER,
    rush INTEGER,
    poke INTEGER
)''')

# データを挿入
cursor.execute('''INSERT INTO types (id, dive, rush, poke) VALUES
    (001, 0, 5, 10),
    (002, 4, 5, 6),
    (003, 0, 8, 10),
    (004, 0, 5, 6),
    (005, 2, 5, 0),
    (006, 0, 5, 7),
    (007, 5, 0, 2),
    (008, 10, 0, 2),
    (009, 5, 2, 7),
    (010, 10, 2, 0),
    (011, 0, 2, 10),
    (012, 0, 5, 10),
    (013, 0, 10, 2),
    (014, 0, 5, 2),
    (015, 10, 4, 2),
    (016, 2, 0, 10),
    (017, 5, 7, 3),
    (018, 0, 10, 5),
    (019, 0, 0, 10),
    (020, 10, 8, 0),
    (021, 0, 7, 5),
    (022, 2, 0, 10),
    (023, 5, 10, 0),
    (024, 0, 8, 5),
    (025, 0, 10, 2),
    (026, 5, 0, 10),
    (027, 0, 0, 5),
    (028, 0, 0, 10),
    (029, 2, 0, 10),
    (030, 10, 0, 0),
    (031, 2, 10, 5),
    (032, 0, 5, 6),
    (033, 10, 2, 0),
    (034, 0, 0, 10),
    (035, 10, 0, 0),
    (036, 10, 0, 2),
    (037, 0, 5, 2),
    (038, 0, 0, 10)''')

# データベースに保存
conn.commit()

# データベースへの接続をクローズする
conn.close()